furtnerthomas/Linux-XMC-Development/ethernet/webserver/RTE/Device/XMC4500-F100x1024/RTE_Device.h
//     <o> CRS_DV (Carrier Sense Data Valid) pin 
//       <0=>P2_5
//       <1=>P0_1
//       <2=>P15_9
//       <3=>P5_2
#define   RTE_ENET_RMII_CRS_DV_PIN_ID     2
#if (RTE_ENET_RMII_CRS_DV_PIN_ID == 0)
 #define RTE_ENET_RMII_CRS_DV_PIN  P2_5
#elif (RTE_ENET_RMII_CRS_DV_PIN_ID == 1)
 #define RTE_ENET_RMII_CRS_DV_PIN  P0_1
#elif (RTE_ENET_RMII_CRS_DV_PIN_ID == 2)
 #define RTE_ENET_RMII_CRS_DV_PIN  P15_9
#elif (RTE_ENET_RMII_CRS_DV_PIN_ID == 3)
 #define RTE_ENET_RMII_CRS_DV_PIN  P5_2
#else
 #error "Invalid CRS_DV pin!"
#endif

//     <o> RXER (Receive Error) pin 
//       <0=>P2_4
//       <2=>P0_11
#define   RTE_ENET_RMII_RXER_PIN_ID     0
#if (RTE_ENET_RMII_RXER_PIN_ID == 0)
 #define RTE_ENET_RMII_RXER_PIN  P2_4
#elif (RTE_ENET_RMII_RXER_PIN_ID == 2)
 #define RTE_ENET_RMII_RXER_PIN  P0_11
#else
 #error "Invalid RXER pin!"
#endif

//     <o> REFCLK (Reference clock) pin 
//       <0=>P2_1
//       <1=>P0_0
//       <2=>P15_8
#define   RTE_ENET_RMII_REFCLK_PIN_ID     2
#if (RTE_ENET_RMII_REFCLK_PIN_ID == 0)
 #define RTE_ENET_RMII_REFCLK_PIN  P2_1
#elif (RTE_ENET_RMII_REFCLK_PIN_ID == 1)
 #define RTE_ENET_RMII_REFCLK_PIN  P0_0
#elif (RTE_ENET_RMII_REFCLK_PIN_ID == 2)
 #define RTE_ENET_RMII_REFCLK_PIN  P15_8
#else
 #error "Invalid REFCLK pin!"
#endif

//   <h> MIIM (Management Data Interface)
//     <o> MDIO (Management data I/O line) pin 
//       <0=>P0_9
//       <1=>P2_0
//       <2=>P1_11
#define   RTE_ENET_MIIM_MDIO_PIN_ID     1
#if (RTE_ENET_MIIM_MDIO_PIN_ID == 0)
 #define RTE_ENET_MIIM_MDIO_PIN   P0_9
 #define RTE_ENET_MIIM_MDIO_HWSEL XMC_GPIO_HWCTRL_PERIPHERAL1
#elif (RTE_ENET_MIIM_MDIO_PIN_ID == 1)
 #define RTE_ENET_MIIM_MDIO_PIN   P2_0
 #define RTE_ENET_MIIM_MDIO_HWSEL XMC_GPIO_HWCTRL_PERIPHERAL1
#elif (RTE_ENET_MIIM_MDIO_PIN_ID == 2)
 #define RTE_ENET_MIIM_MDIO_PIN   P1_11
 #define RTE_ENET_MIIM_MDIO_HWSEL XMC_GPIO_HWCTRL_PERIPHERAL1
#else
 #error "Invalid MDIO pin!"
#endif

//     <o> MDC (Management data clock line) pin 
//       <0=>P0_10
//       <1=>P1_10
//       <2=>P2_7
#define   RTE_ENET_MIIM_MDC_PIN_ID     2

#if (RTE_ENET_MIIM_MDC_PIN_ID == 0)
 #define RTE_ENET_MIIM_MDC_PIN  P0_10
 #define RTE_ENET_MIIM_MDC_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_MIIM_MDC_PIN_ID == 1)
 #define RTE_ENET_MIIM_MDC_PIN  P1_10
 #define RTE_ENET_MIIM_MDC_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_MIIM_MDC_PIN_ID == 2)
 #define RTE_ENET_MIIM_MDC_PIN  P2_7
 #define RTE_ENET_MIIM_MDC_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#else
 #error "Invalid MDC pin!"
#endif

//   </h> MIIM (Management Data Interface)

// </e> ENET (Ethernet Interface) [Driver_ETH_MAC0]

#if ((RTE_UART0+RTE_I2C0+RTE_SPI0)>1)
#error "Choose just one Driver_I2C/SPI/UART0 driver !"
#elif ((RTE_UART1+RTE_I2C1+RTE_SPI1)>1)
#error "Choose just one Driver_I2C/SPI/UART1 driver !"
#elif ((RTE_UART2+RTE_I2C2+RTE_SPI2)>1)
#error "Choose just one Driver_I2C/SPI/UART2 driver !"
#elif ((RTE_UART3+RTE_I2C3+RTE_SPI3)>1)
#error "Choose just one Driver_I2C/SPI/UART3 driver !"
#elif ((RTE_UART4+ RTE_I2C4+RTE_SPI4)>1)
#error "Choose just one Driver_I2C/SPI/UART4 driver !"
#elif ((RTE_UART5+ RTE_I2C5+RTE_SPI5)>1)
#error "Choose just one Driver_I2C/SPI/UART5 driver !"
#endif

#if (((RTE_UART0_RX_FIFO_SIZE_NUM*RTE_UART0)+(RTE_I2C0_RX_FIFO_SIZE_NUM*RTE_I2C0)+(RTE_SPI0_RX_FIFO_SIZE_NUM*RTE_SPI0)+(RTE_UART1_RX_FIFO_SIZE_NUM*RTE_UART1)+(RTE_I2C1_RX_FIFO_SIZE_NUM*RTE_I2C1)+(RTE_SPI1_RX_FIFO_SIZE_NUM*RTE_SPI1)+(RTE_UART0_TX_FIFO_SIZE_NUM*RTE_UART0)+(RTE_I2C0_TX_FIFO_SIZE_NUM*RTE_I2C0)+(RTE_SPI0_TX_FIFO_SIZE_NUM*RTE_SPI0)+(RTE_UART1_TX_FIFO_SIZE_NUM*RTE_UART1)+(RTE_I2C1_TX_FIFO_SIZE_NUM*RTE_I2C1)+(RTE_SPI1_TX_FIFO_SIZE_NUM*RTE_SPI1))>64)
#error "Just 64 positions in a FIFO shared by RTE_x0 and RTE_x1 !"
#elif (((RTE_UART2_RX_FIFO_SIZE_NUM*RTE_UART2)+(RTE_I2C2_RX_FIFO_SIZE_NUM*RTE_I2C2)+(RTE_SPI2_RX_FIFO_SIZE_NUM*RTE_SPI2)+(RTE_UART3_RX_FIFO_SIZE_NUM*RTE_UART3)+(RTE_I2C3_RX_FIFO_SIZE_NUM*RTE_I2C3)+(RTE_SPI3_RX_FIFO_SIZE_NUM*RTE_SPI3)+(RTE_UART2_TX_FIFO_SIZE_NUM*RTE_UART2)+(RTE_I2C2_TX_FIFO_SIZE_NUM*RTE_I2C2)+(RTE_SPI2_TX_FIFO_SIZE_NUM*RTE_SPI2)+(RTE_UART3_TX_FIFO_SIZE_NUM*RTE_UART3)+(RTE_I2C3_TX_FIFO_SIZE_NUM*RTE_I2C3)+(RTE_SPI3_TX_FIFO_SIZE_NUM*RTE_SPI3))>64)
#error "Just 64 positions in a FIFO shared by RTE_x2 and RTE_x3 !"
#elif (((RTE_UART4_RX_FIFO_SIZE_NUM*RTE_UART4)+(RTE_I2C4_RX_FIFO_SIZE_NUM*RTE_I2C4)+(RTE_SPI4_RX_FIFO_SIZE_NUM*RTE_SPI4)+(RTE_UART5_RX_FIFO_SIZE_NUM*RTE_UART5)+(RTE_I2C5_RX_FIFO_SIZE_NUM*RTE_I2C5)+(RTE_SPI5_RX_FIFO_SIZE_NUM*RTE_SPI5)+(RTE_UART4_TX_FIFO_SIZE_NUM*RTE_UART4)+(RTE_I2C4_TX_FIFO_SIZE_NUM*RTE_I2C4)+(RTE_SPI4_TX_FIFO_SIZE_NUM*RTE_SPI4)+(RTE_UART5_TX_FIFO_SIZE_NUM*RTE_UART5)+(RTE_I2C5_TX_FIFO_SIZE_NUM*RTE_I2C5)+(RTE_SPI5_TX_FIFO_SIZE_NUM*RTE_SPI5))>64)
#error "Just 64 positions in a FIFO shared by RTE_x4 and RTE_x5 !"
#endif

#endif  /* __RTE_DEVICE_H */
